#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <windows.h>
#include <stdlib.h>
#include <time.h>

//设计一个程序，判断大小端

//int check_sys()
//{
//	int a = 1;
//
//	return (*(char*)&a);
//	//char*强制类型转换，让&a在解引用时只访问头一个字节的数据
//	//返回1，则为小端；返回0，则为大端
//}
//
//int main()
//{
//	int ret = chect_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}

//练习

//以下结果输出的是什么
//int main()
//{
//	char a = -1;  
//	signed char b = -1;  
//	unsigned char c = -1;  
//
//	printf("a=%d,b=%d,c=%d", a, b, c);  //按照%d打印时，需要整型提升
//	//-1 -1  255
//	//signed char在整型提升的时候，按照符号位进行高位补齐
//	//unsigned char在整型提升的时候高位补0
//
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	//%u 打印无符号整数
//
//	//10000000000000000000000010000000 - 原
//	//11111111111111111111111101111111 - 反
//	//11111111111111111111111110000000 - 补
//	//截断，存入 - 10000000
//	
//	//%u无符号整数打印，整型提升
//	//因为a的类型是有符号类型的char
//	//所以按照符号位，高位补齐
//	//11111111111111111111111110000000 - 整型提升后的结果
//	//再按照无符号整数进行打印
//	//结果为4,294,967,168
//
//	//整型提升的依据是按照这个变量被定义时的数据类型来决定的
//
//	return 0;
//}

//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//
//	//128的二进制补码序列在存入 char a 时，依然要发生截断
//	//即存入的序列为10000000
//	//按照无符号数打印需要整型提升
//	//a的变量类型为有符号整数，所以按照符号位高位补齐
//	//最高位为1，所以补1
//	//即11111111111111111111111110000000 - 整型提升后的结果
//
//	//结果依然为4,294,967,168
//
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//
//	return 0;
//
//	//10的二进制序列
//	//00000000000000000000000000001010 - 原、反、补
//	
//	//-20的二进制序列
//	//10000000000000000000000000010100 - 原
//	//11111111111111111111111111101011 - 反
//	//11111111111111111111111111101100 - 补
//
//	//因为有符号数与无符号数都参与了算术运算
//	//所以要将有符号数转换为无符号数
//
//	//-20补码所对应的无符号整数
//	//11111111111111111111111111101100
//	//为4,294,967,276
//
//	//所以i + j 的算数结果为
//	//4,294,967,276 + 10 = 4,294,967,286
//	//11111111111111111111111111110110 - 这个无符号整型结果对应的二进制补码序列
//
//	//但是在打印的时候，printf函数依旧是以%d有符号整型来进行打印的
//	//所以上述的二进制序列会被printf解读成是一个有符号整数的二进制补码序列
//	//11111111111111111111111111110110 - 又被解读成了有符号整数的二进制补码序列
//	
//	//又因打印需要按照原码打印
//	//所以要进行转换
//	//10000000000000000000000000001010 - 该有符号整数对应的原码序列
//	//该结果为-10
//	//所以最终输出的结果为-10
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);  //休眠1000毫秒，为了更好地让结果可视化
//	}
//
//	//结果会疯狂地进行打印
//
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//char类型数据的取值范围为-128~127
//	//当i--时
//	//-1 -2 -3 ... -126 -127 -128 127 126 ... 3 2 1 0 -1 -2 -3 ..
//	//也就是说，在0之前，一共有128+127=255个字符
//
//	printf("%d", strlen(a)); //255
//	//strlen 是求字符串的长度，关注的是字符串中'\0'（数字0）之前出现多少字符
//	//在ASCII码中，0就代表'\0'
//
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//
//	return 0;
//
//	//死循环
//} 

//int main()
//{
//	if (strlen("abc") - strlen("abcdef") >= 0)
//		printf(">\n");
//	else
//		printf("<\n");
//
//	return 0;
//
//	//结果一定为>
//}

//浮点数的存储
//int main()
//{
//	int n = 9;
//	//9的补码为
//	//00000000000000000000000000001001
//	float* pFloat = (float*)&n;
//
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//
//	//当整数9的二进制补码序列被解读为浮点数时
//	//0 00000000 00000000000000000001001
//	//S=0,E=1-127,M=0.00000000000000000001001
//	//所以这串二进制序列所指代的单精度浮点数为
//	//(-1)^0 * 0.00000000000000000001001*2^-126
//	//这是一个非常接近0的数字
//
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);
//
//	//9.0按照单精度浮点数在内存中存储的二进制序列为
//	//1001.0
//	//(-1)^0 * 1.0010*2^3
//	//S=0,E=3,M=1.0010   在内存中存储的E为E+127=130
//	//0 10000010 00100000000000000000000
//	//这串二进制序列被解读为整数时，所指代的整数为1,091,567,616
//
//	printf("*pFloat的值为：%f\n", *pFloat);
//
//	return 0;
//
//}

//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1  该浮点数的二进制序列
//	//(-1)*0*1.011*2^2  科学计数法表示
//	//S=0,E=2,M=1.011
//	//对于float来说，E需要加上中间值127才能存放在内存中，即129
//	//0    10000001    01100000000000000000000
//	//S        E                M
//	//0100 0000 1011 0000 0000 0000 0000 0000 - 二进制
//	//0x40b00000                              - 十六进制
//
//	return 0;
//}

//收尾习题
//调整奇数偶数顺序

//int main()
//{
//	//创建一个整数数组
//	int arr[10] = { 0 };
//	int arr_tmp[10] = { 0 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	//输入数组元素
//	for (i = 0; i < sz; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//
//	int j = 0;
//
//	//将奇数都放在数组前面
//	for (i = 0; i < sz; i++)
//	{
//		if (arr[i] % 2 == 1)
//		{
//			arr_tmp[j++] = arr[i];
//		}
//	}
//
//	//将偶数都放在数组后面
//	for (i = 0; i < sz; i++)
//	{
//		if (arr[i] % 2 == 0)
//		{
//			arr_tmp[j++] = arr[i];
//		}
//	}
//
//	//将编辑完的结果拷贝到原数组
//	for (i = 0; i < sz; i++)
//	{
//		arr[i] = arr_tmp[i];
//	}
//
//	//输出
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//课堂版本

//void move_odd_even(int* arr, int sz)
//{
//	int left = 0;
//	int right = sz - 1;
//
//	while (left < right)
//	{
//		//左下标找到一个偶数然后停下来
//		while ((left < right) && (arr[left] % 2 == 1))
//		{
//			left++;
//		}
//		
//		while ((left < right) && (arr[right] % 2 == 0))
//		{
//			right--;
//		}
//
//		if (left < right)
//		{
//			int tmp = arr[left];
//			arr[left] = arr[right];
//			arr[right] = tmp;
//			left++;
//			right--;
//		}
//	}
//}
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int sz = sizeof(arr) / sizeof(arr[10]);
//
//	move_odd_even(arr,sz);
//
//	int i = 0;
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//合并两个有序序列
int main()
{
	int n = 5;
	int m = 6;
	//scanf("%d %d", &n, &m);

	int arr1[1000] = { 0 };
	int arr2[1000] = { 0 };

	int i = 0;
	int j = 0;
	int k = 0;

	//输入有序数列
	for (i = 0; i < n; i++)
	{
		scanf("%d", &arr1[i]);
	}

	for (i = 0; i < m; i++)
	{
		scanf("%d", &arr2[i]);
	}

	//谁小，就先打印谁
	while (( j < n ) && ( k < m ))
	{
		if (arr1[j] < arr2[k])
		{
			printf("%d ", arr1[j]);
			j++;
		}
		else
		{
			printf("%d ", arr2[k]);
			k++;
		}
	}

	//判断剩余情况
	if (j < n)
	{
		for ( ; j < n; j++)
		{
			printf("%d ", arr1[j]);
		}
	}
	else
	{
		for (; k < m; k++)
		{
			printf("%d ", arr2[k]);
		}
		
	}

	return 0;
}