#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>

//int main()
//{
//	int a = 40;
//	int c = 212;
//	int cons = (-8 + 22) * a - 10 + c / 2;
//	printf("%d\n", cons);
//	
//	
//	return 0;
//
//}

//int main()
//{
//	char arr[4] = { 'b','i','t' };
//	//不完全初始化，剩余的部分默认初始化为0
//	printf("%d\n", strlen(arr));
//
//	return 0;
//}


//已知一个函数y=f(x)，当x<0,y=1; x=0, y=0; x>0, y=-1
//int main()
//{
//	int x = 0;
//	int y = 0;//先定义好x和y
//	scanf("%d", &x);//输入
//
//	if (x < 0)
//	{
//		y = 1;
//	}
//	else if (x == 0)
//	{
//		y = 0;
//	}
//	else 
//	{
//		y = -1;
//	}
//	//判断的选择语句
//
//	printf("%d\n", y);
//	//根据变量值以及选择语句的结果，打印出y的值
//	return 0;
//
//}

//算数操作符

//整数除法和取模
//int main()
//{
//	int a = 7 / 2;
//	int b = 7 % 2;//取模,得到的是余数，7除以2，商3余1
//
//	//除号的两端都是整数的时候，执行的是整数除法，如果两端只要有一个浮点数就执行浮点数的除法
//
//	printf("%d\n", a);//得到的结果是商 3
//	printf("%d\n", b);//得到的结果是余数 1
//
//	return 0;
//}


//浮点数除法和取模
//int main()
//{
//	float a = 7 /2.0;//如果想要让计算结果是个浮点数，则两端至少有一个是浮点数
//	int b = 7 % 2;//取模操作符的两端必须是整数
//
//
//	printf("%.1f\n", a);
//	//%f代表打印浮点型数据，f前面的.1代表打印结果精确到小数点后1位。（扩展地，f前面的.n代表精确到小数点后n位）
//	
//	printf("%d\n", b);
//
//	return 0;
//}

//移位操作符

//位操作符

//赋值操作符

//int main()
//{
//	int a = 0;//初始化
//	a = 20;//赋值，=为赋值操作符
//
//	a = a + 3;//a=23
//	a += 3;//与上式运算结果一直，且表达形式更简洁
//
//	a = a - 3;//a=17
//	a -= 3;//同理
//
//	return 0;
//}

//单目操作符
// ! 逻辑反操作

//int main()
//{
//	int flag = 0;
//	if (!flag)
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}

//sizeof是操作符，是单目操作符
//int main()
//{
//	int a = 10;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));//对于求数据类型的长度而言，括号不可省略
//	printf("%d\n", sizeof a);//括号可省略
//
//	int arr[10] = { 0 };//定义一个有10个int元素的数组，每个元素初始为0
//	printf("%d\n", sizeof(arr));//40 计算的是整个数组的大小，单位是字节
//	printf("%d\n", sizeof(arr[0]));//一个元素的大小，这里的arr[0]代表求数组中第一个元素的大小
//	printf("%d\n", sizeof(arr)/sizeof(arr[10]));//等于40除以4，10-数组的元素个数
//	
//	//注意：在定义数组时，方括号里的数字代表长度（多少个元素）；在访问数组时，方括号里的数字表示下标（取第几个元素）
//
//	return 0;
//}

//  --前置后置  ++前置后置

//int main()
//{
	//++后置（--同理）

	//int a = 10;
	//int b = a++;//后置++: 先使用，后++
	//int b = a; a = a + 1  把a的值先赋给b，然后a再自增1

	//printf("%d\n", b);//10 因为a把值赋给了b
	//printf("%d\n", a);//11 因为a在把值赋给了b之后，自增了1

	//++前置（--同理）

	//int b = ++a;//前置++，先++，后使用
	//a = a + 1;b=a
//	printf("%d\n", a);//11
//	printf("%d\n", b);//11
//
//
//
//
//	return 0;
//
//}


//强制类型转换

//int main()
//{
//	int a = (int)3.14;//强制将3.14理解为整型
//	printf("%d\n", a);
//	//3.14 字面浮点数，编译器默认理解为double类型
//
//	return 0;
//}

//关系操作符

//int main()
//{
//	int a = 10;
//	if (a == 10)//双等号表示相等，单等号表示赋值
//	{
//		printf("hehe\n");
//	}
//
//
//	return 0;
//
//}

//逻辑操作符

//int main()
//{
//	//&& 逻辑与 - 并且
//	//|| 逻辑或 - 或者
//	int a = 10;
//	int b = 20;
//	if (a && b)//a和b都是非零，即为真才可
//	{
//		printf("hehe\n");//是真，打印
//	}
//
//	int c = 0;
//	int d = 10;
//	if (c && d)//c为假，两者有一为假，就不可执行
//	{
//		printf("haha\n");
//	}
//
//	int e = 10;
//	int f = 0;
//	if (e || f)//虽然f为假，但是“或者”逻辑中，有一个为真，即e，就可执行
//	{
//		printf("go\n");
//	}
//
//	int g = 0;
//	int h = 0;
//	if (g || h)//两者都为假，不可执行
//	{
//		printf("no\n");
//	}
//
//	return 0;
//
//}

//条件操作符

//int main()
//{
//	int a = 10;
//	int b = 20;
//
//	int r = a > b ? a : b;//a > b为第一个条件；？后面的a为第二个条件；：后面的b为第三个条件
//
//	return 0;
//
//}


//逗号表达式
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 0;
//	int d = (c = a - 2, a = b + c, c - 3);//输出的结果是最后一个表达式，即c-3的结果
//	//(1)c=10-2=5; (2)a=20+8=28; (3)c=8-3=5（最终输出结果为5）
//	printf("%d\n", d);
//	return 0;
//
// }



//下标引用操作符[]
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	arr[3] = 20;//[]就是下标引用操作符，arr和3就是[]的操作数。该行代码的意思就是找到数组中的第四个元素把它改成20
//
//	return 0;
//
//}

//函数调用操作符（）
//int add(int x, int y)
//{
//	int z = 0;
//	z = x + y;
//	return (x + y);
//}
//
//int main()
//{
//	int sum = add(2, 3);//()就是函数调用操作符，add，2，3都是()的操作数
//	return 0;
//}


//常见关键字
//int main()
//{
//	auto int a = 10;//自动变量:进入作用域时自动创建，出作用域时自动销毁(所有的变量前面都会用一个auto，只不过把它省略掉了)
//	return 0;
//}